### Total rentals by each customer:

    Question: How many retals has each customer made in total?

In [1]:
# Launch and connect to my pdAdmin4 first
import numpy as np
import pandas as pd
%load_ext sql
%config SqlMagic.displaylimit = 20
%config SqlMagic.autolimit = 30

In [2]:

# load the credentials from the credentials.json file
import json
import urllib.parse

with open('data/credentials.json') as f:
    login = json.load(f)
    
username = login['user']
password = urllib.parse.quote(login['password'])
host = login['host']
port = login['port']

In [3]:
%sql postgresql://{username}:{password}@{host}:{port}/dvdrental

'Connected: postgres@dvdrental'

In [4]:
%%sql

SELECT COUNT(*)
FROM rental

 * postgresql://postgres:***@localhost:5432/dvdrental
1 rows affected.

[(16044,)]

### Extra practice to familiarize the learnt clauses

In [5]:
%%sql
-- To change data type 
SELECT CAST(12.212312 AS INT) AS integre

 * postgresql://postgres:***@localhost:5432/dvdrental
1 rows affected.

[(12,)]

In [6]:
%%sql
-- To round a decimal to a wanted format
SELECT ROUND(12.21231, 4) AS rounded_decimal

 * postgresql://postgres:***@localhost:5432/dvdrental
1 rows affected.

[(Decimal('12.2123'),)]

In [7]:
%%sql
-- To create a string and limit its maximum length
SELECT CAST('this is a string, right?' AS VARCHAR(10)) AS fixed_string2
UNION ALL
SELECT CAST('this is a string, right?' AS VARCHAR(30)) AS fixed_string1

 * postgresql://postgres:***@localhost:5432/dvdrental
2 rows affected.

[('this is a ',), ('this is a string, right?',)]

In [8]:
%%sql
SELECT 
    CAST('this is a string, right?' AS VARCHAR(10)) AS varying_string,
    CAST('this is a string, right?' AS VARCHAR(20)) AS varying_string,
    CAST('myemail@gmail.com' AS CHAR(10)) AS varying_string

 * postgresql://postgres:***@localhost:5432/dvdrental
1 rows affected.

[('this is a ', 'this is a string, ri', 'myemail@gm')]

In [9]:
%%sql
-- To fix a string with a given length
SELECT 
    CAST('myemail@gmail.com' AS CHAR(30)),
    LPAD('myemail@gamil.com', 20, '*'),
    RPAD('myemail@gamil.com', 20, '*')

 * postgresql://postgres:***@localhost:5432/dvdrental
1 rows affected.

[('myemail@gmail.com             ', '***myemail@gamil.com', 'myemail@gamil.com***')]

In [10]:
%%sql
-- Create Date and Time data types
SELECT
    'today'::DATE,
    '2022-3-4'::DATE,
    '13:21:43'::TIME,
    '2021-11-18 8:30:00'::TIMESTAMP;

 * postgresql://postgres:***@localhost:5432/dvdrental
1 rows affected.

[(datetime.date(2024, 9, 20), datetime.date(2022, 3, 4), datetime.time(13, 21, 43), datetime.datetime(2021, 11, 18, 8, 30))]

### TIMESTAMPTZ

It is a timestamp data type with time zone feature, so it is easily to handle date and time on different time zones. 

#### Use +/-00 to note the absolute time zone, which is different from the string format.

*In SQL, when you use a timestamp with a time zone offset (such as +07 or -05), the time zone is relative to UTC (Coordinated Universal Time), also known as the “zero” time zone.*

*-- from Chat GPT*

In [12]:
%%sql 
-- Use TIMESTAMP with time zone features
SELECT 
    '2021-11-19 0:30:00 CST'::TIMESTAMPTZ AT TIME ZONE 'PST', -- CST is for Central Standard TIME
    '2024-09-19 10:30:00-05'::TIMESTAMPTZ,
    '2024-09-19 10:30:00-05'::TIMESTAMPTZ AT TIME ZONE 'UTC', -- UTC is the absolute zero time zone
    '2024-9-18 0:30:00-08'::TIMESTAMPTZ AT TIME ZONE 'PST' AS test; -- Use +08 to show the absolute time

 * postgresql://postgres:***@localhost:5432/dvdrental
1 rows affected.

[(datetime.datetime(2021, 11, 18, 22, 30), datetime.datetime(2024, 9, 19, 8, 30, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=61200))), datetime.datetime(2024, 9, 19, 15, 30), datetime.datetime(2024, 9, 18, 0, 30))]

In [13]:
%%sql

SELECT customer_id, COUNT(*) AS rental_count
FROM rental
GROUP BY customer_id
HAVING COUNT(*) >5
ORDER BY rental_count
LIMIT 10;

 * postgresql://postgres:***@localhost:5432/dvdrental
10 rows affected.

[(318, 12),
 (61, 14),
 (281, 14),
 (110, 14),
 (136, 15),
 (248, 15),
 (492, 16),
 (464, 16),
 (164, 16),
 (398, 16)]

In [14]:
%%sql

SELECT customer_id, SUM(AGE(return_date, rental_date)) AS total_rental_duration
FROM rental
GROUP BY customer_id
HAVING SUM(AGE(return_date, rental_date)) > INTERVAL '100 days'
ORDER BY total_rental_duration
LIMIT 10;

 * postgresql://postgres:***@localhost:5432/dvdrental
10 rows affected.

[(238, datetime.timedelta(days=100, seconds=21300)),
 (165, datetime.timedelta(days=100, seconds=22500)),
 (9, datetime.timedelta(days=100, seconds=28740)),
 (48, datetime.timedelta(days=100, seconds=33720)),
 (310, datetime.timedelta(days=100, seconds=51660)),
 (185, datetime.timedelta(days=100, seconds=61500)),
 (134, datetime.timedelta(days=101, seconds=2100)),
 (428, datetime.timedelta(days=101, seconds=3420)),
 (476, datetime.timedelta(days=101, seconds=35700)),
 (169, datetime.timedelta(days=101, seconds=36780))]

In [15]:
%%sql
SELECT COUNT(DISTINCT customer_id) AS unique_id
FROM customer

 * postgresql://postgres:***@localhost:5432/dvdrental
1 rows affected.

[(599,)]

In [17]:
%%sql
SELECT 
     customer_id, SUM(AGE(return_date, rental_date)) AS total_rental_duration
FROM rental
GROUP BY customer_id
ORDER BY total_rental_duration ASC
LIMIT 10;

 * postgresql://postgres:***@localhost:5432/dvdrental
10 rows affected.

[(110, datetime.timedelta(days=59, seconds=17100)),
 (318, datetime.timedelta(days=59, seconds=20040)),
 (97, datetime.timedelta(days=64, seconds=36780)),
 (395, datetime.timedelta(days=69, seconds=18780)),
 (248, datetime.timedelta(days=72, seconds=12300)),
 (136, datetime.timedelta(days=76, seconds=1740)),
 (117, datetime.timedelta(days=76, seconds=14640)),
 (162, datetime.timedelta(days=76, seconds=43800)),
 (378, datetime.timedelta(days=76, seconds=44640)),
 (281, datetime.timedelta(days=77, seconds=25020))]

In [18]:
%%sql
-- To classify every payment into three levels
SELECT payment_id, amount, payment_date,
    CASE 
        WHEN amount < 5 THEN 'low'
        WHEN amount BETWEEN 5 AND 10 THEN 'medium'
        ELSE 'high'
    END AS extent
FROM payment
LIMIT 10;

 * postgresql://postgres:***@localhost:5432/dvdrental
10 rows affected.

[(17503, Decimal('7.99'), datetime.datetime(2007, 2, 15, 22, 25, 46, 996577), 'medium'),
 (17504, Decimal('1.99'), datetime.datetime(2007, 2, 16, 17, 23, 14, 996577), 'low'),
 (17505, Decimal('7.99'), datetime.datetime(2007, 2, 16, 22, 41, 45, 996577), 'medium'),
 (17506, Decimal('2.99'), datetime.datetime(2007, 2, 19, 19, 39, 56, 996577), 'low'),
 (17507, Decimal('7.99'), datetime.datetime(2007, 2, 20, 17, 31, 48, 996577), 'medium'),
 (17508, Decimal('5.99'), datetime.datetime(2007, 2, 21, 12, 33, 49, 996577), 'medium'),
 (17509, Decimal('5.99'), datetime.datetime(2007, 2, 17, 23, 58, 17, 996577), 'medium'),
 (17510, Decimal('5.99'), datetime.datetime(2007, 2, 20, 2, 11, 44, 996577), 'medium'),
 (17511, Decimal('2.99'), datetime.datetime(2007, 2, 20, 13, 57, 39, 996577), 'low'),
 (17512, Decimal('4.99'), datetime.datetime(2007, 2, 16, 0, 10, 50, 996577), 'low')]

In [48]:
%%sql
-- In payment table, let us try to extract the rows where amount is larger than 5.30 
-- then, group by rows by customer ids 
-- and do average aggregation
-- on the payment, finally, filter the grouped by table with the condition - 
-- average payment larger than or equal to 6.5 

-- 1. extract the rows where the amounts are larger than 5.3

SELECT customer_id, ROUND(AVG(amount),4) AS average_amount
FROM payment
WHERE amount > 6.5
-- 2. find all 
GROUP BY customer_id
HAVING AVG(amount) >= 7
-- ORDER BY average_amount DESC
ORDER BY average_amount DESC

 * postgresql://postgres:***@localhost:5432/dvdrental
539 rows affected.

[(420, Decimal('10.9900')),
 (364, Decimal('10.9900')),
 (277, Decimal('10.9900')),
 (12, Decimal('10.9900')),
 (73, Decimal('9.9900')),
 (288, Decimal('9.9900')),
 (325, Decimal('9.9900')),
 (136, Decimal('9.9900')),
 (543, Decimal('9.9900')),
 (441, Decimal('9.9900')),
 (545, Decimal('9.9900')),
 (404, Decimal('9.6567')),
 (220, Decimal('9.4900')),
 (418, Decimal('9.4900')),
 (340, Decimal('9.4900')),
 (547, Decimal('9.4900')),
 (561, Decimal('9.4900')),
 (542, Decimal('9.3900')),
 (57, Decimal('9.3233')),
 (571, Decimal('9.2400')),
 (13, Decimal('9.2400')),
 (19, Decimal('9.1567')),
 (436, Decimal('9.1567')),
 (87, Decimal('9.1567')),
 (448, Decimal('9.1567')),
 (359, Decimal('8.9900')),
 (93, Decimal('8.9900')),
 (537, Decimal('8.9900')),
 (550, Decimal('8.9900')),
 (297, Decimal('8.9900'))]